{"data":{"markdownRemark":{"frontmatter":{"title":"All Companies","subtitle":"My Experience"}},"allMarkdownRemark":{"edges":[{"node":{"id":"a88366ce-7646-5fc1-ba0c-f0ecf8bb4950","html":"<p>Responsible for the full range of testing (automated &#x26; manual) on the \"SiteWorx\" internet-of-things cloud application (web &#x26; mobile). As new features are rolled-out (backend &#x26; frontend), I coordinate with product managers and developers to outline acceptance criteria, document &#x26; organize test cases in our TestRail suite, execute manual, exploratory testing on development builds/branches, and develop automated UI tests with scripts written in Python and run with Selenium/Appium. In addition to the SiteWorx cloud applications, I test the in-house built commisioning software used by application engineers out in the field to configure and calibrate ligting fixtures/systems.</p>","frontmatter":{"company":"Digital Lumens","position":"Quality Assurance Engineer","startDate":"Jul 2018","endDate":"Present"}}},{"node":{"id":"5a9d05d9-d5e5-5795-b81a-f74a94687bee","html":"<p>Designed, documented, and executed a wide range of manual testing plans including acceptance, regression, smoke, and ad-hoc tests for the Android Mobile Application development team. Lead efforts to push testing further \"left\" (i.e. earlier) in the development and deployment cycles by building out end-to-end test automation. Leveraged the Espresso testing framework along with the JUnit test runner to develop and run automated UI tests for all critical components / flows within the Android mobile app. Worked with the DevOps team to get these tests incorporated into the team's Continous Integration system. Ultimately, these efforts boosted confidenct by increasing overall test coverage and enabled agility by driving down time between releases.</p>","frontmatter":{"company":"Wayfair","position":"Software QA Analyst","startDate":"Jan 2016","endDate":"May 2018"}}},{"node":{"id":"6b4a73da-93a0-5e8a-b6a4-b5e1e06f01b8","html":"<p>Drove the growth of Wayfair’s nascent Private Label Credit Card business by leading key product initiatives which resulted in\nover 300k active cardholders and accounted for 10% of weekly revenue by the end of it's first year. Collaborated with Design, Engineering, and Analytics in order to test and implement site changes that drove improvement of key credit card application funnel metrics such as landing page click-through rate. Continuosly analyzed Clickstream data to identify pain-points, technical bugs, and opportunities for improvements.</p>","frontmatter":{"company":"Wayfair","position":"Associate Product Manager","startDate":"Aug 2014","endDate":"Jan 2016"}}},{"node":{"id":"115b3514-64d1-518a-95d0-2bee33175b16","html":"<p>Performed thorough quality assurance on incoming additions to the product catalog in order to ensure a clear, consistent experience for the customer. Successfully analyzed product data by utilizing internal tools, SQL scripts/queries, and Excel. Directly communicated with suppliers and categroy managers to resolve issues and/or retrieve additional product information.</p>","frontmatter":{"company":"Wayfair","position":"Merchandising Specialist","startDate":"Oct 2012","endDate":"Jul 2014"}}},{"node":{"id":"0e59144a-49ac-5cbe-96b2-cca038e40060","html":"<p>Oversaw all functioning aspects of assigned chairlifts including: start-up / closing procedures, chair loading, guest assistance,\nand lift area maintenance. Quickly rose to the posisiton of team lead and received “Rookie of the Year” award for being voted best new member of the Breckenridge Lift Operations team.</p>","frontmatter":{"company":"Vail Resorts","position":"Chairlift Operator","startDate":"Dec 2011","endDate":"Sept 2012"}}}]}}}